# read Csv

In [1]:
import pandas as pd

In [6]:
import numpy as np

In [11]:
import csv

In [13]:
file = open('A.csv.txt')

In [14]:
type(file)

_io.TextIOWrapper

In [15]:
csvreader = csv.reader(file)

In [16]:
csvreader

In [17]:
header = []

In [18]:

header = next(csvreader)

In [19]:

header

['a', 'b', 'c', 'd', 'message']

In [20]:
rows = []

In [21]:

for row in csvreader:
        rows.append(row)

In [22]:
rows

[['1', '2', '3', '4', 'hello'],
 ['5', '6', '7', '8', 'world'],
 ['9', '10', '11', '12', 'foo']]

In [30]:
csvreader

In [31]:
df=pd.read_csv('A.csv.txt')

In [32]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [33]:
pd.read_table('A.csv.txt',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [34]:
pd.read_table('A.csv.txt',header=None)

                 0
0  a,b,c,d,message
1    1,2,3,4,hello
2    5,6,7,8,world
3   9,10,11,12,foo

In [36]:
pd.read_csv('A.csv.txt',names=['22','23','24','25','ayesha'])

  22  23  24  25   ayesha
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [37]:
names=['22','23','24','25','ayesha']

In [39]:
pd.read_csv('A.csv.txt',names=names,index_col='ayesha')

        22  23  24  25
ayesha
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [40]:
parsed=pd.read_csv('mindex.csv.txt',index_col=['key1','key2'])

In [41]:
parsed

           value1  value
key1 key2
one  a          1      2
     b          3      4
     c          5      6
     d          7      8
two  a          9     10
     b         11     12
     c         13     14
     d         15     16

In [42]:
list(open('B.csv.txt'))

['A      B     C\n',
 'aaaa   -2345678  -234567765  4567676\n',
 'bbbb   -09876     4567654322   23456\n',
 'cccc   -098755    346456       245467\n',
 'dddd   -098        24676       9597']

In [45]:
result=pd.read_table('B.csv.txt')

In [46]:
result

                   A          B        C
0   aaaa   -2345678  -234567765  4567676
1   bbbb   -09876     4567654322   23456
2  cccc   -098755    346456       245467
3    dddd   -098        24676       9597

In [47]:
result=pd.read_table('B.csv.txt',sep='\s+')

In [48]:
result

            A           B        C
aaaa -2345678  -234567765  4567676
bbbb    -9876  4567654322    23456
cccc   -98755      346456   245467
dddd      -98       24676     9597

In [49]:
result=pd.read_csv('C.csv.txt')

In [50]:
result

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6   7   8   world
2     three  9  10  11  12     foo

In [51]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [53]:
result=pd.read_csv('C.csv.txt',na_values=['Null'])

In [54]:
result

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6   7   8   world
2     three  9  10  11  12     foo

In [55]:
sentinels={'meassage':['foo','NA'],'something':['two']}

In [56]:
pd.read_csv('C.csv.txt',na_values=sentinels)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6   7   8   world
2     three  9  10  11  12     foo

In [57]:
pd.options.display.max_rows=2

In [58]:
result=pd.read_csv('A.csv.txt')

In [59]:
result

    a   b   c   d message
0   1   2   3   4   hello
.. ..  ..  ..  ..     ...
2   9  10  11  12     foo

[3 rows x 5 columns]

In [60]:
pd.read_csv('A.csv.txt',nrows=2)

   a  b  c  d message
0  1  2  3  4   hello
1  5  6  7  8   world

In [61]:
chunker=pd.read_csv('A.csv.txt',chunksize=3)

In [62]:
chunker

# working with delimited formats

In [64]:
f=open('E.csv.txt')

In [65]:
reader=csv.reader(f)

In [67]:
for line in reader:print(line)

['1', '2', '3', '4']
['1', '2', '3', '4']
['1', '2', '3', '4']

In [69]:
with open('E.csv.txt')as f:
      lines=list(csv.reader(f))

In [70]:
header ,values =lines[0],lines[1:]

In [71]:
data_dict={h:v for h ,v in zip(header,zip(*values))}

In [72]:
data_dict

{'a': ('1', '1', '1'),
 'b': ('2', '2', '2'),
 'c': ('3', '3', '3'),
 'd': ('4', '4', '4')}